////////////////////////////////////////////////////////////////////////////////
/**
  \file
  \brief \ru Константы.
         \en Constraints. \~

*/
////////////////////////////////////////////////////////////////////////////////


#ifndef __CONSTRAINT_H_
#define __CONSTRAINT_H_


//------------------------------------------------------------------------------
/** \brief \ru Класс эллипса. \~
  \details \ru Эллипс является потомком класса MbCurve. \n
*/
//------------------------------------------------------------------------------


///< \ru Погрешность вычисления.
static const double EPSILON =  1e-06;


///< \ru Погрешность вычисления.
static const double XI =  1e-08;


///< \ru Число Пи.
static const double PI =  3.1415926535;


///< \ru Угол, показывающий отклонение касательного вектор в новой точке от касательного вектора в старой точке.
static const double deltaAlfa =  PI / 100.0;


///< \ru Расстояние от клика мыши до кривой, при котором эта кривая становится селектированной.
static const double radius = 5.0;


///< \ru Минимальный параметрический шаг.
static const double minDeltaT = 0.075;


///< \ru Максимальный параметрический шаг.
static const double maxDeltaT = 0.5;


#endif // __CONSTRAINT_H
